Revit 2023 API
FabricWireItem.WireType Property
 The wire type of this wire item
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public ElementId WireType { get; set; }
Visual Basic
Public Property WireType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ WireType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: wireType is not a valid Element identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace